load-test-stress.yml
# Stress Test Configuration
# High-load scenario for stress testing
#
# Run: artillery run load-test-stress.yml
# WARNING: This generates significant load - use on staging only!

config:
  target: "http://localhost:3000"
  phases:
    # Quick warm-up
    - duration: 10
      arrivalRate: 10
      name: "Quick warm up"
    
    # Rapid ramp to stress level
    - duration: 30
      arrivalRate: 10
      rampTo: 100
      name: "Ramp to stress"
    
    # Stress test peak
    - duration: 60
      arrivalRate: 100
      name: "Stress peak"
    
    # Spike test
    - duration: 10
      arrivalRate: 200
      name: "Spike test"
    
    # Recovery
    - duration: 30
      arrivalRate: 50
      rampTo: 10
      name: "Recovery"

  defaults:
    headers:
      Content-Type: "application/json"

  # Metrics thresholds for stress testing
  ensure:
    p99: 5000         # Allow higher latency under stress
    maxErrorRate: 10  # Allow higher error rate

scenarios:
  # Health endpoint stress
  - name: "Health Check Stress"
    weight: 40
    flow:
      - get:
          url: "/api/health"

  # Page loads under stress
  - name: "Mixed Page Loads"
    weight: 40
    flow:
      - get:
          url: "/student"
      - think: 1
      - get:
          url: "/volunteer"
      - think: 1
      - get:
          url: "/"

  # Rate limit test
  - name: "Rate Limit Test"
    weight: 20
    flow:
      - loop:
        - get:
            url: "/api/health"
        count: 10