load-test.yml
# Load Testing Configuration
# Uses Artillery for load testing: https://artillery.io
#
# Install: npm install -g artillery
# Run: artillery run load-test.yml
# Quick test: artillery quick --count 10 --num 5 http://localhost:3000/api/health

config:
  target: "http://localhost:3000"
  phases:
    # Warm-up phase
    - duration: 30
      arrivalRate: 5
      name: "Warm up"
    
    # Ramp up to peak load
    - duration: 60
      arrivalRate: 5
      rampTo: 50
      name: "Ramp up load"
    
    # Sustained peak load
    - duration: 120
      arrivalRate: 50
      name: "Sustained peak"
    
    # Ramp down
    - duration: 30
      arrivalRate: 50
      rampTo: 5
      name: "Ramp down"

  defaults:
    headers:
      Content-Type: "application/json"
      Accept: "application/json"

  # Ensure tests complete even if some requests fail
  ensure:
    p99: 3000        # 99th percentile response time < 3s
    maxErrorRate: 5  # Max 5% error rate

scenarios:
  # Health check endpoint (high traffic)
  - name: "Health Check"
    weight: 30
    flow:
      - get:
          url: "/api/health"
          expect:
            - statusCode: 200

  # Student registration page load
  - name: "Student Page Load"
    weight: 25
    flow:
      - get:
          url: "/student"
          expect:
            - statusCode: 200

  # Volunteer page load
  - name: "Volunteer Page Load"
    weight: 20
    flow:
      - get:
          url: "/volunteer"
          expect:
            - statusCode: 200

  # Staff login page
  - name: "Staff Login Page"
    weight: 10
    flow:
      - get:
          url: "/staff/login"
          expect:
            - statusCode: 200

  # Static assets (simulated)
  - name: "Home Page"
    weight: 15
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200